/******************************************************************************

                              Online C++ Compiler.
               Code, Compile, Run and Debug C++ program online.
Write your code in this editor and press "Run" button to compile and execute it.

*******************************************************************************/

#include <iostream>

using namespace std;

int main()
{
int D, M;
cout << "Введите число месяца(1-31):";
cin >> D;
cout << "Введите месяц(1-12):";
cin >> M;
if (D == 1)
{
cout << "Первое" << " ";
}
if (D == 2)
{
cout << "Второе" << " ";
}
if (D == 3)
{
cout << "Третье" << " ";
}
if (D == 4)
{
cout << "Четвёртое" <<" ";
}
if (D == 5)
{
cout << "Пятое" <<" ";
}
if (D == 6)
{
cout << "Шестое" << " ";
}
if (D == 7)
{
cout << "Седьмое" << " ";
}
if (D == 8)
{
cout << "Восьмое" << " ";
}
if (D == 9)
{
cout << "Девятое" <<" ";
}
if (D == 10)
{
cout << "Десятое" << " ";
}
if (D == 11)
{
cout << "Одиннадцатое" << " ";
}
if (D == 12)
{
cout << "Двенадцатое" << " ";
}
if (D == 13)
{
cout << "Тринадцатое" << " ";
}
if (D == 14)
{
cout << "Четырнадцатое" << " ";
}
if (D == 15)
{
cout << "Пятнадцатое" << " ";
}
if (D == 16)
{
cout << "Шестнадцатое" << " ";
}
if (D == 17)
{
cout << "Семнадцатое" << " ";
}
if (D == 18)
{
cout << "Восемнадцатое" << " ";
}
if (D == 19)
{
cout << "Девятнадцатое" << " ";
}
if (D == 20)
{
cout << "Двадцатое" << " ";
}
if (D == 21)
{
cout << "Двадцать первое" << " ";
}
if (D == 22)
{
cout << "Двадцать второе" <<" ";
}
if (D == 23)
{
cout << "Двадцать третье" << " ";
}
if (D == 24)
{
cout << "Двадцать четвертое" << " ";
}
if (D == 25)
{
cout << "Двадцать пятое" << " ";
}
if (D == 26)
{
cout << "Двадцать шестое" << " ";
}
if (D == 27)
{
cout << "Двадцать седьмое" << " ";
}
if (D == 28)
{
cout << "Двадцать восьмое" << " ";
}
if (D == 29)
{
cout << "Двадцать девятое" << " ";
}
if (D == 30)
{
cout << "Тридцатое" << " ";
}
if (D == 31)
{
cout <<"Тридцать первое" << " ";
}

if (M == 1)
{
cout << "января" << endl;
}
if (M == 2)
{
cout << "февраля" << endl;
}
if (M == 3)
{
cout << "марта" << endl;
}
if (M == 4)
{
cout << "апреля" << endl;
}
if (M == 5)
{
cout << "мая" << endl;
}
if (M == 6)
{
cout << "июня" << endl;
}
if (M == 7)
{
cout << "июля" << endl;
}
if (M == 8)
{
cout << "августа" << endl;
}
if (M == 9)
{
cout << "сентября" << endl;
}
if (M == 10)
{
cout << "октября" << endl;
}
if (M == 11)
{
cout << "ноября" << endl;
}
if (M == 12)
{
cout << "декабря" << endl;
}
if ((D > 28) and (M == 2))
{
cout << "В феврале 28 дней)))" << endl;
}
if ((D > 30) and ((M == 4) or (M == 6) or (M == 9) or (M == 11)))
{
cout << "В этом месяце 30 дней" << endl;
}
return 0;
}

